src/__tests__/performance/artillery.yml
config:
  target: 'http://127.0.0.1:4000' # URL base de tu API
  phases:
    - duration: 60 # Duración de la prueba en segundos
      arrivalRate: 20 # Número de solicitudes por segundo
  variables:
    jwt: '' # Variable para almacenar el JWT capturado en el login
scenarios:
  - flow:
    - post:
        url: '/login' # Endpoint para iniciar sesión y obtener un JWT
        json:
          username: 'agonzalezb'
          password: '00092068426'
        capture:
          json: '$.data.token'
          as: 'jwt'
    - get:
        url: '/users' # Endpoint para obtener información de usuarios utilizando un JWT
        headers:
          Authorization: 'Bearer {{ jwt }}'
    - post:
        url: '/users/artillery' # Endpoint para crear un nuevo usuario en el directorio LDAP
        json:
          username: 'newuser'
          password: 'password'
          email: 'newuser@example.com'